<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>Главная страница</title>
    <link rel="stylesheet" href="StyleCSS/main.css">
    <link rel="shortcut icon" href="img/musicIcon.png" type="image/x-icon">
</head>
<body>
<ul class="nav">
    <li><a href="main.jsp" class="s2">Главная страница</a></li>
    <li><a href="musician.jsp" class="s2">Музыканты</a></li>
    <li><a href="album.jsp" class="s2">Альбомы</a></li>
    <li><a href="composition.jsp" class="s2">Композиции</a></li>
</ul>
<section class="sect">
    <h1>"Лабораторная работа №8"</h1>
    <h2>В процессе написания тестовых заданий ознакомиться с Hibernate, JSP, AJAX.</h2>
</section>
<div class="info">
    <p>1) Удалить таблицы из БД, созданные в результате выполнения лабораторной работы №6. БД удалять не нужно!<br>
        Используя Hibernate, создать и заполнить таблицы заново. Для этого нужно будет описать три вспомогательных класса и файл hibernate.cfg.xml.<br>
        Маппинг объекта на таблицу реализовать с использованием аннотаций.</p>
    <p>2) Продемонстрировать вывод данных, а также добавление, удаление и редактирование данных в любой из таблиц.</p>
    <p>3) Разработать информационную систему на основе JavaEE-технологий. В качестве СУБД использовать PostgreSQL. В качестве сервера приложений использовать TomCat.<br>
        Система должна предоставлять возможность просмотра, добавления, удаления и редактирования данных из базы данных, а также выполнять и показывать результаты запросов (не менее двух запросов, каждый из которых работает минимум с двумя таблицами).<br>
        Вся работа с системой производится через Web-интерфейс, представленный в виде JSP-страниц. Маппинг объекта на таблицу реализовать с использованием аннотаций.</p>
    <p>4) Добавить в предыдущее задание возможность автозаполнения полей в таблицах с применением AJAX.</p>
</div>
<div class="text">
    <p>В процессе написания тестовых заданий ознакомиться с Hibernate, JSP, AJAX.</p>
    <p>Лабораторная работа по дисциплине JavaEE</p>
    <p>Студента группы 6133-090401D</p>
    <p>Тышкуна Андрея Юрьевича</p>
</div>
</body>
</html>
